'''给出一个 32 位的有符号整数，你需要将这个整数中每位上的数字进行反转。
示例 1:
输入: 123
输出: 321
 示例 2:
输入: -123
输出: -321
示例 3:
输入: 120
输出: 21
注意:
假设我们的环境只能存储得下 32 位的有符号整数，则其数值范围为 [−231,  231 − 1]。请根据这个假设，如果反转后整数溢出那么就返回 0。'''
''''''
class Solution:
    def reverse(self, x: int) -> int:
        st = str(x)    # 将int转换为字符串
        if st[0] == '-':
            st = st[1:][::-1]   # 将st除了第一个字符，后面的字符反转
            x = int(st)
            x = -x
        else:
            st = st[::-1]
            x = int(st)

        return (x) if -2147483648 < x < 2147483647 else 0

if __name__ == '__main__':
    s = Solution()
    print(s.reverse(10200))